import Hospital from "../Hospital";

const doctors = [
    {
        id : "1",
        name : "홍길동",
        star : "1.8",
        explain : `정성껏 진료하는 수의사입니다.
정성껏 진료하는 수의사입니다.
정성껏 진료하는 수의사입니다.정성껏 진료하는 수의사입니다.`,
        time : "09:00 ~ 18:00",
        hospital : "올리몰스 동물메디컬센터",
        animal : ["강아지", "고양이", "햄스터"],
        Price : {
                "1회" : "30,000",
                "3회" : "80,000"
        },
        Career : `전북대학교 수의과대학 졸업
올리몰스 동물메디컬센터 수의사`
    },
    {
        id : "2",
        name : "홍길동",
        star : "4.8",
        explain : `정성껏 진료하는 수의사입니다.`,
        time : "09:00 ~ 18:00",
        hospital : "올리몰스 동물메디컬센터",
        animal : ["강아지", "고양이", "햄스터"],
        Price : {
                "1회" : "30,000",
                "3회" : "80,000"
        },
        Career : `전북대학교 수의과대학 졸업
올리몰스 동물메디컬센터 수의사`
    },
    {
        id : "3",
        name : "홍길동",
        star : "31.8",
        explain : `정성껏 진료하는 수의사입니다.
정성껏 진료하는 수의사입니다.
정성껏 진료하는 수의사입니다.
정성껏 진료하는 수의사입니다.정성껏 진료하는 수의사입니다.`,
        time : "09:00 ~ 18:00",
        hospital : "올리몰스 동물메디컬센터",
        animal : ["강아지", "고양이"],
        Price : {
                "1회" : "30,000",
                "3회" : "80,000"
        },
        Career : `전북대학교 수의과대학 졸업
올리몰스 동물메디컬센터 수의사`
    },
]
export default doctors;